create_clock -period 25.000 -name VIRTUAL_clk_out1_R_W_PLL -waveform {0.000 12.500}
create_clock -period 25.000 -name VIRTUAL_clk_out2_R_W_PLL -waveform {11.111 23.611}
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay 5.500 [get_ports CTRL_io]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 13.000 [get_ports CTRL_io]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay 0.100 [get_ports rstn_i]
set_input_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 1.200 [get_ports rstn_i]
set_input_delay -clock [get_clocks VIRTUAL_clk_out2_R_W_PLL] -min -add_delay 0.100 [get_ports rstn_i]
set_input_delay -clock [get_clocks VIRTUAL_clk_out2_R_W_PLL] -max -add_delay 1.200 [get_ports rstn_i]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay -0.500 [get_ports CTRL_io]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 6.000 [get_ports CTRL_io]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay -0.500 [get_ports busy_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 6.000 [get_ports busy_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay -0.500 [get_ports id_err_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 6.000 [get_ports id_err_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay -0.500 [get_ports idle_err_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 6.000 [get_ports idle_err_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay -0.500 [get_ports init_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 6.000 [get_ports init_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay -0.500 [get_ports power_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 6.000 [get_ports power_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay -0.500 [get_ports pwr_enable_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 6.000 [get_ports pwr_enable_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay -0.500 [get_ports read_err_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 6.000 [get_ports read_err_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay -0.900 [get_ports rst_n_io_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 2.200 [get_ports rst_n_io_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay -0.500 [get_ports slave_err_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 6.000 [get_ports slave_err_led_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -min -add_delay -1.000 [get_ports xc7a_led0_o]
set_output_delay -clock [get_clocks VIRTUAL_clk_out1_R_W_PLL] -max -add_delay 6.000 [get_ports xc7a_led0_o]
set_clock_groups -physically_exclusive -group [get_clocks -include_generated_clocks clk_rx] -group [get_clocks -include_generated_clocks mii_rx_clk_i]
set_clock_groups -physically_exclusive -group [get_clocks -include_generated_clocks clk_tx_mac] -group [get_clocks -include_generated_clocks mii_tx_clk_i]
set_clock_groups -asynchronous -group [get_clocks s_sysclk_x2_in] -group [get_clocks mii_rx_clk_i]
set_clock_groups -asynchronous -group [get_clocks s_sysclk_x2_in] -group [get_clocks mii_tx_clk_i]
set_clock_groups -asynchronous -group [get_clocks mii_rx_clk_i] -group [get_clocks s_sysclk_x2_in]
set_clock_groups -asynchronous -group [get_clocks mii_tx_clk_i] -group [get_clocks s_sysclk_x2_in]
set_clock_groups -asynchronous -group [get_clocks clk_out1_R_W_PLL] -group [get_clocks clk_ipb_i]
set_clock_groups -asynchronous -group [get_clocks clk_ipb_i] -group [get_clocks clk_out1_R_W_PLL]
